In [3]:
import pandas as pd
import numpy as np

In [4]:
dict1 = {
    'Name': ['Priyang', 'Aadhya', 'Krishna', 'Vedant', 'Parshv', 'Mittal', 'Archana'],
    'Marks': [98, np.nan, 99, 87, np.nan, 83, 99],
    'Gender': ['Male', 'Female', 'Female', 'Male', 'Male', 'Female', 'Female'],
    'Email': ['priyang@gmail.com', 'aadhya@gmail.com', 'krishna@gmail.com', 'vedant@yahoo.com', 'parshv@hotmail.com', 'mittal@yahoo.com', 'archana@yahoo.com']
}

df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2  Krishna   99.0  Female   krishna@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [ ]:
# 1. Top 3 Rows of the dataset

In [5]:
df1. head(3)

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
1   Aadhya    NaN  Female   aadhya@gmail.com
2  Krishna   99.0  Female  krishna@gmail.com

In [ ]:
# 2. Last 3 Rows of the dataset

In [6]:
df1.tail(3)

      Name  Marks  Gender               Email
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [7]:
# All the rows except the last 2 rows

In [9]:
df1.head(-2)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2  Krishna   99.0  Female   krishna@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com

In [10]:
# all the rows except the first 3 rows

In [11]:
df1.tail(-3)

      Name  Marks  Gender               Email
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [12]:
# find the shape of our dataset

In [13]:
df1.shape

(7, 4)

In [14]:
print("Number of Rows",df1.shape[0])
print("Number of Columns",df1.shape[1])

Number of Rows 7
Number of Columns 4

In [16]:
df1['Marks'].shape

(7,)

In [17]:
# get information about our dataset

In [18]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
dtypes: float64(1), object(3)
memory usage: 356.0+ bytes

In [19]:
# check null values in our dataset

In [21]:
df1.isnull().sum()

Name      0
Marks     2
Gender    0
Email     0
dtype: int64

In [22]:
# get overall statistucs about our dataset

In [24]:
df1.describe(include='all')

           Name      Marks  Gender              Email
count         7   5.000000       7                  7
unique        7        NaN       2                  7
top     Priyang        NaN  Female  priyang@gmail.com
freq          1        NaN       4                  1
mean        NaN  93.200000     NaN                NaN
std         NaN   7.628892     NaN                NaN
min         NaN  83.000000     NaN                NaN
25%         NaN  87.000000     NaN                NaN
50%         NaN  98.000000     NaN                NaN
75%         NaN  99.000000     NaN                NaN
max         NaN  99.000000     NaN                NaN

In [25]:
# find unique values from the gender column

In [27]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [29]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [30]:
df1['Marks'].unique()

array([98., nan, 99., 87., 83.])

In [32]:
# find the number of unique values from the gender column

In [34]:
df1['Gender'].nunique()

2

In [35]:
df1.nunique()

Name      7
Marks     4
Gender    2
Email     7
dtype: int64

In [36]:
# display count of unique values in gender column

In [37]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [40]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2  Krishna   99.0  Female   krishna@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [38]:
# Handling missing values

In [42]:
df1.dropna(how='all')

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2  Krishna   99.0  Female   krishna@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [44]:
df1.fillna(0)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    0.0  Female    aadhya@gmail.com
2  Krishna   99.0  Female   krishna@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    0.0    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [49]:
df1['Marks']=df1['Marks'].fillna(df1['Marks'].mean())

In [50]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
2  Krishna   99.0  Female   krishna@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv   93.2    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [51]:
# marks between 80 to 90

In [57]:
sum((df1['Marks']>=80) & (df1['Marks']<=90))

2

In [59]:
sum(df1['Marks'].between(80,90))

2

In [60]:
# Name of the students with lowest marks

In [61]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [67]:
df1[df1['Marks'].min()==df1['Marks']]['Name']

5    Mittal
Name: Name, dtype: object

In [68]:
# Top 5 students by their marks

In [69]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [70]:
df1.nlargest(5,'Marks')

      Name  Marks  Gender               Email
2  Krishna   99.0  Female   krishna@gmail.com
6  Archana   99.0  Female   archana@yahoo.com
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
4   Parshv   93.2    Male  parshv@hotmail.com

In [71]:
df1.nlargest(5,'Marks')['Name']

2    Krishna
6    Archana
0    Priyang
1     Aadhya
4     Parshv
Name: Name, dtype: object

In [73]:
df1.nlargest(5,'Marks')[['Name','Marks']]

      Name  Marks
2  Krishna   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [76]:
df1.sort_values(by='Marks',ascending=False).head()[['Name','Marks']]

      Name  Marks
2  Krishna   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [77]:
# find Avg marks

In [78]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
2  Krishna   99.0  Female   krishna@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv   93.2    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [80]:
df1['Marks'].mean()

93.2

In [81]:
df1['Marks'].min()

83.0

In [82]:
df1['Marks'].max()

99.0

In [83]:
# Aply method

In [137]:
df1

      Name  Marks  Gender               Email  Half_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2  Krishna   99.0  Female   krishna@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [138]:
def marks(x):
  return x/2

In [139]:
df1['Marks'].apply(marks)

0    49.0
1    46.6
2    49.5
3    43.5
4    46.6
5    41.5
6    49.5
Name: Marks, dtype: float64

In [140]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [141]:
df1

      Name  Marks  Gender               Email  Half_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2  Krishna   99.0  Female   krishna@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [108]:
# Map function

In [142]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [143]:
df1

      Name  Marks  Gender               Email  Half_marks  Male_Female
0  Priyang   98.0    Male   priyang@gmail.com        49.0            1
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6            0
2  Krishna   99.0  Female   krishna@gmail.com        49.5            0
3   Vedant   87.0    Male    vedant@yahoo.com        43.5            1
4   Parshv   93.2    Male  parshv@hotmail.com        46.6            1
5   Mittal   83.0  Female    mittal@yahoo.com        41.5            0
6  Archana   99.0  Female   archana@yahoo.com        49.5            0

In [144]:
df1.drop('Male_Female',axis=1,inplace=False)

      Name  Marks  Gender               Email  Half_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2  Krishna   99.0  Female   krishna@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [124]:
# Inplace

In [126]:
df1

      Name  Marks  Gender               Email  Half_marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2  Krishna   99.0  Female   krishna@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [128]:
# Sort the dataframe as per the marks columns

In [145]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender               Email  Half_marks  Male_Female
2  Krishna   99.0  Female   krishna@gmail.com        49.5            0
6  Archana   99.0  Female   archana@yahoo.com        49.5            0
0  Priyang   98.0    Male   priyang@gmail.com        49.0            1
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6            0
4   Parshv   93.2    Male  parshv@hotmail.com        46.6            1
3   Vedant   87.0    Male    vedant@yahoo.com        43.5            1
5   Mittal   83.0  Female    mittal@yahoo.com        41.5            0

In [146]:
# Display Name & marks of the female students

In [149]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya   93.2
2  Krishna   99.0
5   Mittal   83.0
6  Archana   99.0

In [151]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya   93.2
2  Krishna   99.0
5   Mittal   83.0
6  Archana   99.0

In [152]:
# Rename the markscolumns

In [153]:
df1.rename(columns={'Marks':"Final_Marks"})

      Name  Final_Marks  Gender               Email  Half_marks  Male_Female
0  Priyang         98.0    Male   priyang@gmail.com        49.0            1
1   Aadhya         93.2  Female    aadhya@gmail.com        46.6            0
2  Krishna         99.0  Female   krishna@gmail.com        49.5            0
3   Vedant         87.0    Male    vedant@yahoo.com        43.5            1
4   Parshv         93.2    Male  parshv@hotmail.com        46.6            1
5   Mittal         83.0  Female    mittal@yahoo.com        41.5            0
6  Archana         99.0  Female   archana@yahoo.com        49.5            0

In [154]:
# concate two dataset

In [159]:
df2 = pd.DataFrame({
    'Name': 'Anil',
    'Marks': 90,
    'Gender': 'Male',
    'Email': 'anil@gmail.com'
}, index=[0])

df2

   Name  Marks Gender           Email
0  Anil     90   Male  anil@gmail.com

In [160]:
df3 = pd.concat([df1,df2],ignore_index=True)

In [161]:
df3

      Name  Marks  Gender               Email  Half_marks  Male_Female
0  Priyang   98.0    Male   priyang@gmail.com        49.0          1.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6          0.0
2  Krishna   99.0  Female   krishna@gmail.com        49.5          0.0
3   Vedant   87.0    Male    vedant@yahoo.com        43.5          1.0
4   Parshv   93.2    Male  parshv@hotmail.com        46.6          1.0
5   Mittal   83.0  Female    mittal@yahoo.com        41.5          0.0
6  Archana   99.0  Female   archana@yahoo.com        49.5          0.0
7     Anil   90.0    Male      anil@gmail.com         NaN          NaN

In [2]:
# loc & iloc

In [5]:
df1.loc[:,'Marks':'Gender']

   Marks  Gender
0   98.0    Male
1    NaN  Female
2   99.0  Female
3   87.0    Male
4    NaN    Male
5   83.0  Female
6   99.0  Female

In [8]:
df1.iloc[:,3]

0     priyang@gmail.com
1      aadhya@gmail.com
2     krishna@gmail.com
3      vedant@yahoo.com
4    parshv@hotmail.com
5      mittal@yahoo.com
6     archana@yahoo.com
Name: Email, dtype: object

In [16]:
df1['Name_Marks']=df1['Name'] + ','+df1['Marks'].apply(str)

In [17]:
df1

      Name  Marks  Gender               Email    Name_Marks
0  Priyang   98.0    Male   priyang@gmail.com  Priyang,98.0
1   Aadhya    NaN  Female    aadhya@gmail.com    Aadhya,nan
2  Krishna   99.0  Female   krishna@gmail.com  Krishna,99.0
3   Vedant   87.0    Male    vedant@yahoo.com   Vedant,87.0
4   Parshv    NaN    Male  parshv@hotmail.com    Parshv,nan
5   Mittal   83.0  Female    mittal@yahoo.com   Mittal,83.0
6  Archana   99.0  Female   archana@yahoo.com  Archana,99.0

In [18]:
# find the highest avg value as per gender

In [28]:
df1.groupby('Gender')['Marks'].mean().sort_values().to_frame()

            Marks
Gender
Male    92.500000
Female  93.666667

In [29]:
# what are the top 5 most popular email providers

In [30]:
df1

      Name  Marks  Gender               Email    Name_Marks
0  Priyang   98.0    Male   priyang@gmail.com  Priyang,98.0
1   Aadhya    NaN  Female    aadhya@gmail.com    Aadhya,nan
2  Krishna   99.0  Female   krishna@gmail.com  Krishna,99.0
3   Vedant   87.0    Male    vedant@yahoo.com   Vedant,87.0
4   Parshv    NaN    Male  parshv@hotmail.com    Parshv,nan
5   Mittal   83.0  Female    mittal@yahoo.com   Mittal,83.0
6  Archana   99.0  Female   archana@yahoo.com  Archana,99.0

In [39]:
list1 =[]
for email in df1['Email']:
    list1.append(email.split('@')[1])

In [40]:
#df1['Email'][0].split('@')[1]

In [42]:
df1['temp']=list1

In [43]:
df1

      Name  Marks  Gender               Email    Name_Marks         temp
0  Priyang   98.0    Male   priyang@gmail.com  Priyang,98.0    gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com    Aadhya,nan    gmail.com
2  Krishna   99.0  Female   krishna@gmail.com  Krishna,99.0    gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com   Vedant,87.0    yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com    Parshv,nan  hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com   Mittal,83.0    yahoo.com
6  Archana   99.0  Female   archana@yahoo.com  Archana,99.0    yahoo.com

In [44]:
df1['temp'].value_counts()

temp
gmail.com      3
yahoo.com      3
hotmail.com    1
Name: count, dtype: int64

In [48]:
df1['Email'].apply(lambda x:x.split('@')[1]).value_counts().head()

Email
gmail.com      3
yahoo.com      3
hotmail.com    1
Name: count, dtype: int64